Tekla Open API Reference for Tekla Structures 2025
AnalysisModelGeneralProperties Properties
The AnalysisModelGeneralProperties type exposes the following members.
Properties
Name | Description
AnalysisEngineName
 The name of the analysis engine.
ExtendedClashCheck
 Defines whether the extended clash check is used.
FilterName
 The name of the filter.
MemberAxisLocation
 The location of the member axis.
MemberEndReleaseMethodByConnection
 Defines whether the support conditions of connections or parts are used.
ModalAnalysisModel
 Defines whether the modal analysis properties are used instead of the static load combinations.
ModelCreationType
 The model creation type.
ModelMerging
 Defines whether the model merging is used.
ModelName
 The name of the model.
NodeDefinition
 Defines how the nodes and node positions are defined.
Top
See Also
Reference
AnalysisModelGeneralProperties Class
Tekla.Structures.Analysis Namespace